use NMMST_HR
GO

-- =============================================
-- 將已存在的 Trigger 刪除
-- =============================================
IF EXISTS (SELECT name 
	   FROM   sysobjects 
	   WHERE  name = N'trig_sys06_d' 
	   AND 	  type = 'TR')
    DROP TRIGGER trig_sys06_d
GO


CREATE TRIGGER trig_sys06_d
ON sys06

FOR DELETE
AS 

/**************************************************
1. 程式描述：當系統模組–sys06 刪除資料時所要做的處理

2. 程式步驟：(0)(0)程式不需執行條件：當異動資料不等於 1 筆則不處理
   　　　　　(1)修改《系統子系統–sys05》表格的資料「模組代碼」，失敗則判定儲存失敗

3. 撰寫人員：fen

4. 修改日期：2006/4/10
**************************************************/

/* --------------------------------------------------------------------------------------- 
   程式不需執行條件
--------------------------------------------------------------------------------------- */ 

-- 當異動資料不等於 1 筆則不處理
IF @@rowcount <> 1 RETURN


/* --------------------------------------------------------------------------------------- 
   程式開始執行
--------------------------------------------------------------------------------------- */ 

-- 修改《系統子系統–sys05》表格的資料「模組代碼」
UPDATE sys05
	SET s05_mod_id = Null
	WHERE s05_mod_id in (SELECT s06_mod_id FROM deleted)

-- 判斷如果失敗則離開
IF @@ERROR <> 0
BEGIN
	ROLLBACK
	RETURN
END

GO
