use NMMST_HR
GO

-- =============================================
-- 將已存在的 Trigger 刪除
-- =============================================
IF EXISTS (SELECT name 
	   FROM   sysobjects 
	   WHERE  name = N'trig_user01_u' 
	   AND 	  type = 'TR')
    DROP TRIGGER trig_user01_u
GO


CREATE TRIGGER trig_user01_u
ON user01

FOR UPDATE
AS 

/**************************************************
1. 程式描述：當使用者帳號–user01 修改資料時所要做的處理

2. 程式步驟：(0)程式不需執行條件：當異動資料不等於 1 筆則不處理
   　　　　　(1)修改《使用者帳號使用者–sys02》表格的資料「使用者帳號」，失敗則判定儲存失敗

3. 撰寫人員：fen

4. 修改日期：2006/5/15
**************************************************/

/* --------------------------------------------------------------------------------------- 
   程式不需執行條件
--------------------------------------------------------------------------------------- */ 

-- 當異動資料不等於 1 筆則不處理
IF @@rowcount <> 1 RETURN

-- 判斷異動資料欄位不為「使用者帳號」則不處理
IF (SELECT RTrim(user01_id) FROM inserted) = (SELECT RTrim(user01_id) FROM deleted) RETURN


/* --------------------------------------------------------------------------------------- 
   程式開始執行
--------------------------------------------------------------------------------------- */ 

-- 修改《使用者帳號使用者–sys02》表格的資料「使用者帳號」
UPDATE sys02
	SET s02_user_id = (SELECT user01_id FROM inserted)
	WHERE s02_user_id = (SELECT user01_id FROM deleted)

-- 判斷如果失敗則離開
IF @@ERROR <> 0
BEGIN
	ROLLBACK
	RETURN
END

GO
